# Terraform `environment` `test`
#### Initialization ⚙️`success`
#### Format and Style 🖌`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

[Lines containing Refreshing state removed]
[Truncated to 120000 bytes! See logoutput for complete plan]
Acquiring state lock. This may take a few moments...
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1jMjE3YTNlYS00MDJmLTQ4ODYtYWNlNS00NzhkYjcyYWI0Yzk7b2JqZWN0SWQ9Y2M3NWExY2MtZDZhMS00NTMwLTgyOGYtODY4MzJjZTkxYjliO3N1YnNjcmlwdGlvbklkPTM3YmFjNjNhLWI5NjQtNDZiMi04ZGU4LWJhOTNjNDMyZWExZjt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
module.observability.data.azurerm_client_config.current: Reading...
module.observability.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1jMjE3YTNlYS00MDJmLTQ4ODYtYWNlNS00NzhkYjcyYWI0Yzk7b2JqZWN0SWQ9Y2M3NWExY2MtZDZhMS00NTMwLTgyOGYtODY4MzJjZTkxYjliO3N1YnNjcmlwdGlvbklkPTM3YmFjNjNhLWI5NjQtNDZiMi04ZGU4LWJhOTNjNDMyZWExZjt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.grafana.azurerm_role_assignment.amw_datareaderrole["/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/auth-at22-obs-rg/providers/Microsoft.Monitor/accounts/auth-at22-obs-amw"] will be destroyed
  # (because key ["/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/auth-at22-obs-rg/providers/Microsoft.Monitor/accounts/auth-at22-obs-amw"] is not in for_each map)
  - resource "azurerm_role_assignment" "amw_datareaderrole" {
      - id                                     = "/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/auth-at22-obs-rg/providers/Microsoft.Monitor/accounts/auth-at22-obs-amw/providers/Microsoft.Authorization/roleAssignments/211cf5fb-abe4-4133-d037-7efb14f54847" -> null
      - name                                   = "211cf5fb-abe4-4133-d037-7efb14f54847" -> null
      - principal_id                           = "a8aaf992-8052-4766-931d-4168de4bf359" -> null
      - principal_type                         = "ServicePrincipal" -> null
      - role_definition_id                     = "/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/providers/Microsoft.Authorization/roleDefinitions/b0d8363b-8ddd-447d-831f-62ca05bff136" -> null
      - role_definition_name                   = "Monitoring Data Reader" -> null
      - scope                                  = "/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/auth-at22-obs-rg/providers/Microsoft.Monitor/accounts/auth-at22-obs-amw" -> null
        # (4 unchanged attributes hidden)
    }

  # module.grafana.azurerm_role_assignment.amw_datareaderrole["default-obs-workspace"] will be created
  + resource "azurerm_role_assignment" "amw_datareaderrole" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "a8aaf992-8052-4766-931d-4168de4bf359"
      + principal_type                   = (known after apply)
      + role_definition_id               = "/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/providers/Microsoft.Authorization/roleDefinitions/b0d8363b-8ddd-447d-831f-62ca05bff136"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/auth-at22-obs-rg/providers/Microsoft.Monitor/accounts/auth-at22-obs-amw"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

| Context | Values |
| - | - |
| Pusher | @tjololo |
| Action | `push` |
| Working Directory | `./infrastructure/altinn-auth-test/auth-at22-aks-rg` |
| State File | `github.com/altinn/altinn-platform/environments/test/auth-at22-aks-rg.tfstate` |
| Plan File | `github.com_altinn_altinn-platform_environments_test_auth-at22-aks-rg.tfstate.tfplan` |